Autodesk.Navisworks.Api.FileResolvingEventArgs
Event arguments used for the Application::FileResolving event

Autodesk.Navisworks.Api.FileResolvingEventArgs.FileNameToOpen
Set file name to open to read contents of resolved file.
Leave as null if ResolveToOpen is false or file can’t be resolved.

Autodesk.Navisworks.Api.FileResolvingEventArgs.Handled
Set whether event handler has handled file resolution.
If set to true, default file resolution will not occur.

Autodesk.Navisworks.Api.FileResolvingEventArgs.ResolvedFileReference
Set file reference that Autodesk.Navisworks.Api.FileResolutionEventArgs.FileReference has been resolved to.
Leave as null if file can’t be resolved.